<div class="display home content">


	<div class="card border-secondary mb-3" id="caution">
        <div class="card-header">
            <h5 class="mb-0">
                ご要望・ご質問に対する回答
            </h5>
        </div>
        <div class="card-body text-dark">
            <p>
                全てのご要望・ご質問に対する回答ではありません。</br>
                よくあるご意見や、回答が明確なものを掲載しています。</br>
                採用された要望に関しては、サイレントで盛り込まれているので、対応しない理由を記述したものが多くなっております。ご了承ください。</br>
            </p>
            <dl class="list">
                <dt>☆11やAAA難易度に対応してほしい</dt>
                <dd>
                    結論から言うと、現在対応する予定はありません。</br>
                    CPIは、全てのプレイヤーがSP☆12のランプを実力目一杯埋めているという仮定に基づいて推定を行っています。</br>
                    SP☆11は☆12と比べて、実力に見合わないランプのまま放置されているケースが多く、推定の信頼度が落ちると考えられるからです。</br>
                    AAA難易度については、必要とするユーザーが比較的少数であること、既に別サービスの『BPI』が広く利用されていること、といった理由があります。</br>
                </dd>
                <dt>スマホのアプリで提供してほしい</dt>
                <dd>
                    開発者の技術力不足と学習および管理のコストの問題で、今のところ対応する予定はありません。</br>
                </dd>
                <dt>レートの数値に対してイメージが湧かないので、レートごとの具体例が欲しい。</dt>
                <dd>
                    ざっくりとしたレート区分ごとに、具体的にどのようなランプが適正であるかを提示するような機能について、今後実装する予定です。</br>
                </dd>
                <dt>手動でランプを編集したい</dt>
                <dd>
                    当サイトのご利用は公式サイトにてプレミアムコースに加入していることを前提としております。</br>
                    当サイトは公式サイトからの定期的なデータ取得により難易度推定を行っており、末永く円滑にご利用頂くために、ご理解とご協力をお願い致します。</br>
                </dd>
                <dt>譜面傾向を加味した機能が欲しい</dt>
                <dd>
                    2つの理由から現在対応する予定はありません。</br>
                    ①各プレイヤーの得意・不得意を難易度推定に反映させることが技術的に難しい</br>
                    ②各プレイヤーの主観的な難易度評価と客観的な難易度評価とのズレを苦手譜面・苦手要素の発見に活用してほしい</br>
                    なお、ランプ状況（特定のランプ種が多い・少ないなど）に関しては今後反映した推定を公表する可能性があります。</br>
                </dd>
                <dt>各段ごとのレーティングの平均はどのように算出している？</dt>
                <dd>
                    プレーデータを公開しているプレイヤーに対してレーティングを算出し、段位ごとに中央値をとっています。</br>
                </dd>
            </dl>
        </div>
    </div>

</div>
